# ------------------------------------------------------------------------------
# Lesson 20. 偏差値とIQ
# ------------------------------------------------------------------------------
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# Import
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
from scipy.stats import norm

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# 偏差値
# 平均値が50、標準偏差は10に揃えたデータ
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
scorelist = [60, 70, 80]

for score in scorelist:
  cdf = norm.cdf(x=score, loc=50, scale=10)
  print("偏差値", score, "は上から", (1 - cdf) * 100, "%")

perlist = [0.1586, 0.02275, 0.00134]
for per in perlist:
  ppf = norm.ppf(q=(1 - per), loc=50, scale=10)
  print("上から", per * 100, "%以上に入るには、偏差値", ppf, "以上が必要")

print()

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# IQ
# 平均値が100、標準偏差は15 or 24に揃えたデータ
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
std = 15
IQlist = [110, 130, 148]
for IQ in IQlist:
  cdf = norm.cdf(IQ, loc=100, scale=std)
  print("IQ", IQ, "は上から", (1 - cdf) * 100, "%")

std = 24
IQlist = [110, 130, 148]
for IQ in IQlist:
  cdf = norm.cdf(IQ, loc=100, scale=std)
  print("IQ", IQ, "は上から", (1 - cdf) * 100, "%")
